fonecmid-diplom/src/Documents/ВМК_ОбслуживаниеКлиента/ВМК_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВМК_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВМК_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВМК_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВМК_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВМК_УсловияОплатыСотрудников/ВМК_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВМК_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВМК_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВМК_ВыполненныеСотрудникомРаботы/ВМК_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВМК_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВМК_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВМК_ВыполненныеКлиентуРаботы/ВМК_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВМК_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВМК_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий

Перем СохраненныеЗначенияРеквизитов; 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СохранитьТекущиеЗначенияРеквизитов();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
    СоздатьУведомлениеТелеграм();
КонецПроцедуры   


Процедура ОбработкаПроведения(Отказ,Режим)

	Если Договор.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не верный вид договора. Проверьте наличие договора абонентского обслуживания!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
		
	ВМК_ВыполненныеСотрудникомРаботы(Отказ);
	ЗаполнениеВыполненныхКлиентуРабот(Отказ);	
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьТекущиеЗначенияРеквизитов()
	
	СохраненныеЗначенияРеквизитов = Новый Структура;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВМК_ОбслуживаниеКлиента.Дата,
			|	ВМК_ОбслуживаниеКлиента.Специалист,
			|	ВМК_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
			|	ВМК_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан
			|ИЗ
			|	Документ.ВМК_ОбслуживаниеКлиента КАК ВМК_ОбслуживаниеКлиента
			|ГДЕ
			|	ВМК_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			СохраненныеЗначенияРеквизитов.Вставить("Дата", Выборка.Дата);
			СохраненныеЗначенияРеквизитов.Вставить("Специалист", Выборка.Специалист);
			СохраненныеЗначенияРеквизитов.Вставить("ВремяНачалаРаботПлан", Выборка.ВремяНачалаРаботПлан);
			СохраненныеЗначенияРеквизитов.Вставить("ВремяОкончанияРаботПлан", Выборка.ВремяОкончанияРаботПлан);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьУведомлениеТелеграм()

	НужноСоздатьУведомление = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		НужноСоздатьУведомление = Истина;
	ИначеЕсли СохраненныеЗначенияРеквизитов = Неопределено ИЛИ СохраненныеЗначенияРеквизитов.Количество() = 0 Тогда
		НужноСоздатьУведомление = Истина;
	Иначе
		НужноСоздатьУведомление = ИзменилисьКлючевыеРеквизиты();
	КонецЕсли;
	
	Если НужноСоздатьУведомление Тогда
		СоздатьЭлементУведомления();
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменилисьКлючевыеРеквизиты()

	Возврат НачалоДня(Дата) <> НачалоДня(СохраненныеЗначенияРеквизитов.Дата)
		ИЛИ Специалист <> СохраненныеЗначенияРеквизитов.Специалист
		ИЛИ ВремяНачалаРаботПлан <> СохраненныеЗначенияРеквизитов.ВремяНачалаРаботПлан
		ИЛИ ВремяОкончанияРаботПлан <> СохраненныеЗначенияРеквизитов.ВремяОкончанияРаботПлан;
	
КонецФункции

Процедура СоздатьЭлементУведомления()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НовыйЭлемент = Справочники.ВМК_УведомленияТГ.СоздатьЭлемент();
		
		НовыйЭлемент.Текст_Сообщения = СтрШаблон("Заявка № %1 от %2. Клиент %3. Необходимо %4. 
			|Назначенный специалист: %5. Время начала работ: %6. Время окончания работ: %7", 
			Номер, Формат(Дата, "ДФ=dd.MM.yyyy"), Клиент, ОписаниеПроблемы, Специалист, 
			Формат(ВремяНачалаРаботПлан, "ДЛФ=В"), Формат(ВремяОкончанияРаботПлан, "ДЛФ=В"));
		
		НовыйЭлемент.Записать();
		
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ЗаписьЖурналаРегистрации("ВМК_ОшибкаСозданияУведомления", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ВМК_ОбслуживаниеКлиента,
			?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
						
КонецПроцедуры

Процедура ВМК_ВыполненныеСотрудникомРаботы(Отказ)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВМК_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВМК_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК ВМК_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВМК_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтавкаЧасаКлиента = Договор.ВМК_СуммаЧасаРаботы;
	Если ВыборкаДетальныеЗаписи.ПроцентОтРабот = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Заполните знчение процента от выполненых работ у сотрудника %1", Специалист.Наименование);
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
	ПроцентОтРабот = Число(ВыборкаДетальныеЗаписи.ПроцентОтРабот);
	Движения.ВМК_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВМК_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту*СтавкаЧасаКлиента*ПроцентОтРабот/100;
	
	КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнениеВыполненныхКлиентуРабот(Отказ)
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВМК_ОбслуживаниеКлиента.Договор.ВМК_ДатаНачалаДоговора КАК ДатаНачалаДоговора,
		|	ВМК_ОбслуживаниеКлиента.Договор.ВМК_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
		|	ВМК_ОбслуживаниеКлиента.Договор.ВМК_СуммаЧасаРаботы КАК СуммаЧасаРаботы,
		|	ВМК_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК КоличествоЧасов,
		|	ВМК_ОбслуживаниеКлиента.Дата КАК ДатаДокумента
		|ИЗ
		|	Документ.ВМК_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВМК_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВМК_ОбслуживаниеКлиента КАК ВМК_ОбслуживаниеКлиента
		|		ПО (ВМК_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВМК_ОбслуживаниеКлиента.Ссылка)
		|ГДЕ
		|	ВМК_ОбслуживаниеКлиента.Договор = &Договор";
		
		Запрос.УстановитьПараметр("Договор", Договор );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	Если ВыборкаДетальныеЗаписи.ДатаДокумента > ВыборкаДетальныеЗаписи.ДатаНачалаДоговора 
					И ВыборкаДетальныеЗаписи.ДатаДокумента < ВыборкаДетальныеЗаписи.ДатаОкончанияДоговора Тогда
		
	Движения.ВМК_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВМК_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаЧасаРаботы*ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
	КонецЦикла;
	ИначеЕсли ВыборкаДетальныеЗаписи.ДатаДокумента < ВыборкаДетальныеЗаписи.ДатаНачалаДоговора Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Дата документа не соответствует сроку действия договора. Дата начала действия договора %1", ВыборкаДетальныеЗаписи.ДатаНачалаДоговора);
		Сообщение.Сообщить();
		Отказ = Истина;
	ИначеЕсли ВыборкаДетальныеЗаписи.ДатаДокумента > ВыборкаДетальныеЗаписи.ДатаОкончанияДоговора Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Дата документа не соответствует сроку действия договора. Договор окончил действие %1", ВыборкаДетальныеЗаписи.ДатаОкончанияДоговора);
		Сообщение.Сообщить();
		Отказ = Истина;	
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
